def parse_input(user_input): # розбиратиме введений користувачем рядок на команду та її аргументи. Команди та аргументи мають бути розпізнані незалежно від регістру введення.
    # програма повинна очікувати на введення команд користувачем та обробляти їх за допомогою відповідних функцій. 
    # В разі введення команди "exit" або "close", програма повинна завершувати виконання.
    # програма має вміти ідентифікувати та повідомляти про неправильно введені команди.
    cmd, *args = user_input.split() # Перше слово зберігається у змінній cmd, а решта зберігається у списку args завдяки оператору розпакування *
    cmd = cmd.strip().lower() # видаляє зайві пробіли навколо команди та перетворює її на нижній регістр
    return cmd, *args